---
kind: type
id: T:Autodesk.Revit.DB.CategoryNameMapIterator
source: html/fa6d0b34-31f3-af66-41ae-66bf433d9a2f.htm
---
# Autodesk.Revit.DB.CategoryNameMapIterator

An iterator to a category name map.

## Syntax (C#)
```csharp
public abstract class CategoryNameMapIterator : APIObject,
	IEnumerator
```